<?php

require __DIR__ . '/vendor/autoload.php';

$smarty = new Smarty;

$smarty->assign('abilities',
    array(
        '1С-Битрикс (сертифицированный партнер, только сертифицированные программисты, 164 проекта, более 16742 часов)',
        'Symfony (более 4100часов)',
        'WordPress (более 2160 часов)',
        'OpenCart (более 3200 часов)',
        'Umi.CMS (более 660 часов, официальный партнер)',
        'Zend Framework (более 2600 часов)',
        'Joomla (более 1940 часов)',
        'Drupal (более 1280 часов)',
        'NetCat (более 530 часов)',
        'Yii PHP Framework (более 200 часов)',
        'AngularJS (более 900 часов)',
        'ReactJS (более 1350 часов)',
        'React Native (более 100 часов)',
        'WebRTC (2 проекта, более 250 часов)',
        'ffmpeg (более 100 часов)',
        'Smarty (более 4000 часов)',
        'TypeScript (более 1400 часов)',
        'Node.js (7 проектов, более 300 часов)',
        'Java (3 проекта, более 400 часов)',
        'Android (2 приложения, более 400 часов)',
        'HTML5, Less, Scss, jQuery, JavaScript (более 4000 часов)',
        'Самописные системы (113 проектов, более 22980 часов)',
        '*nix и windows сервера (более 70 серверов)',
        'интеграция различных CMS/CMF с 1С (более 50 раз)',
        'интеграция с системами примема платежей (более 80 раз)',
        'и многое другое'
    )
);

$smarty->display('templates/index.tpl');